title: AWS KMS CMK Created Without Key Rotation Enabled
id: 8c460cf7-3a15-4385-a1e6-d6d1a9d12a5b
description: Detects when a customer-managed KMS key is created without key rotation enabled, which is a recommended security best practice
status: experimental
author: Owaiz Khan 
references:
  - https://docs.aws.amazon.com/kms/latest/developerguide/rotate-keys.html
logsource:
  service: cloudtrail
  category: configuration
detection:
  kmsRotationDisabled:
    eventSource: kms.amazonaws.com
    eventName: CreateKey
    requestParameters.enableKeyRotation: false
  condition: kmsRotationDisabled
fields:
  - userIdentity.arn
  - requestParameters.keyUsage
  - requestParameters.enableKeyRotation
  - requestParameters.description
  - eventTime
  - sourceIPAddress
falsepositives:
  - Rotation is handled manually or externally
  - Use of keys in short-lived testing environments
level: high
tags:
  - aws
  - kms
  - cmk
  - key-rotation
  - cloudtrail
  - compliance
